{
  "TNS_0001_V.mp4": "The video depicts a chaotic street scene with a large crowd of people gathered and moving around. The environment appears tense, with individuals actively engaged in various activities. There are no visible weapons or signs of gun use, and no people in uniform raising their arms. Some individuals are seen throwing objects, possibly stones, and others are involved in physical altercations, such as swinging sticks or bats. There are no military vehicles present in the scene. The weather seems overcast, and the ground is wet, suggesting recent rain or ongoing drizzle. Some people appear to be injured or lying on the ground, indicating a possible conflict or unrest. The general atmosphere is one of disorder and unrest.",
  "TNS_0002_V.MP4": "The video depicts a chaotic scene involving a group of people gathered around a red vehicle. The individuals appear agitated, with some engaging in physical altercations. There are no visible weapons such as guns, and no one in uniform is raising their arms. However, there are instances of people throwing punches and pushing each other. The vehicle is a standard red car, with no military vehicles present. The license plate or markings on the car are not clearly visible. One person is lying on a stretcher, appearing injured with visible blood on their clothing, suggesting they might have been hurt during the altercation. The weather seems dry, and there are no signs of rain or puddles. The crowd consists of both uniformed and non-uniformed individuals, with the latter actively involved in the physical conflict.",
  "TNS_0075_V.mp4": "The video depicts a man lying on a bed in a room with brick walls. He is wearing a light-colored garment and appears to be engaged in a conversation or interview, as suggested by the presence of a microphone near him. There are no visible weapons or signs of use of force in the scene. No people in uniform are raising their arms, and there is no indication of fighting or aggressive behavior. There are no vehicles present in the scene. The man does not appear to be injured or hurt; he is simply reclining on the bed. The weather conditions are not visible as the scene is indoors.",
  "TNS_0169_V.mp4": "The video shows an outdoor urban scene with two individuals walking on a sidewalk. One person is wearing a light blue shirt and dark pants, while the other is in a military-style uniform. There is no visible use of weapons or force, and no one is raising their arms or engaging in any form of physical altercation. There are no vehicles present in the scene. The uniformed person appears to be walking alongside the other individual, and there is no indication of any injury or distress. The weather appears to be clear, with no signs of rain or puddles. A billboard with Arabic text is visible in the foreground, but the exact text is not legible.",
  "TNS_0194_V.mp4": "The video depicts a chaotic scene involving a group of uniformed personnel in beige attire and helmets, who appear to be engaging with civilians. The uniformed individuals are seen using sticks and batons, and some are physically restraining or pushing people. There are no visible firearms in use. The uniformed personnel are not raising their arms but are actively involved in what seems to be a confrontation. Civilians, including women and men in various colored clothing, are being handled roughly by the uniformed group. There are no visible military vehicles, and the environment appears to be an urban setting with structures and debris around. The weather seems clear, with no indication of rain or adverse conditions. No one appears to be lying on the ground, but the actions suggest a tense and possibly violent situation.",
  "TNS_0210_V.mp4": "The video depicts a chaotic scene outside a building with a large gate, where a crowd of people is gathered. The area appears to be wet, suggesting recent rain, with puddles visible on the ground. There is a mix of individuals, some in uniform and others in civilian clothing. The uniforms are dark, and some uniformed individuals are raising their arms, possibly in a gesture of control or signaling. There is no visible use of firearms or other weapons, but there are instances of physical altercations, with people throwing punches and sticks. No military vehicles are present in the scene. The gate has text in Arabic, which translates to \"Entrance to the Ministry of Interior, General Directorate.\" No one appears to be visibly injured or lying on the ground. The overall atmosphere is tense, with people actively engaging in confrontations.",
  "TNS_0340_V.mp4": "The video depicts a chaotic scene with several uniformed personnel, likely military or police, in beige uniforms and helmets, moving through an area with scattered debris and puddles. There are visible fires and smoke in the background, indicating a recent disturbance or conflict. Some individuals in civilian clothing are present, with one person lying on the ground, suggesting they may be injured. The uniformed personnel appear to be dispersing or managing the crowd, with some holding batons. No firearms are clearly visible in use, and there is no indication of people raising their arms or engaging in physical altercations. The weather seems overcast, and the ground is wet, possibly from rain. There are no military vehicles visible in the scene.",
  "TNS_0420_V.mp4": "The video depicts a chaotic scene with a large number of people, many of whom are in military or police uniforms, gathered in what appears to be an outdoor setting. The uniforms are primarily light-colored, with some individuals wearing helmets. There are visible weapons, including rifles held by uniformed personnel. Some individuals in uniform are raising their arms, possibly signaling or directing others. There is no clear indication of fighting, but the atmosphere suggests tension, with some individuals appearing to be restrained or in distress. A few people are lying on the ground, possibly indicating injury or exhaustion. There are no distinct military vehicles visible, and the environment appears dry with no signs of rain or puddles. The overall scene is tense and suggests a situation involving law enforcement or military presence.",
  "TNS_0456_V.mp4": "The video depicts a chaotic street scene with numerous people gathered, some engaged in physical altercations. Several individuals are seen carrying or restraining others, indicating a possible conflict or protest. There are no visible weapons or signs of gunfire, and no one in uniform is raising their arms. People are seen throwing punches and swinging objects, suggesting a violent confrontation. Vehicles, including cars and a white SUV, are present, but there are no military vehicles. The scene is set in a rainy environment, evidenced by puddles on the ground. A billboard in the background reads \"Number 1 in Sudan,\" indicating the location. Some individuals appear injured or are being attended to by others. The overall atmosphere is tense and disorderly.",
  "TNS_0478_V.mp4": "The video depicts a tense scene where a group of civilians is being controlled by uniformed personnel. The uniformed individuals, wearing beige and blue camouflage, are seen standing around and interacting with the seated civilians. Some of the uniformed personnel are holding sticks, which they use to manage the crowd. There are no visible firearms, but the presence of sticks indicates the use of force. The civilians appear distressed, with some raising their hands, possibly in a gesture of surrender or to avoid being hit. There is no visible fighting or aggressive physical actions like punching or kicking. No military vehicles are present in the scene. The weather appears to be clear, with no signs of rain or puddles. The overall atmosphere is one of tension and control, with the uniformed personnel maintaining order over the seated civilians."
}